TestCases/TaylorBubbleBoiling/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 0 0 1 0 0 0];

internalField       uniform 307.15;

boundaryField
{
  
    Heater
    {
        //type fixedValue;
        //value uniform 313.15;
        type fixedGradient;
        gradient uniform 2E5;    //  6.0 W/cm2  8E5
    }
    
    Walls
    {
        //type fixedValue;
        //value uniform 313.15;
        type zeroGradient;
        
    }
    
    
    Inlet
    {
        type            fixedValue;
        value           uniform 307.15;
    }

    Outlet
    {
        type            inletOutlet;
        inletValue      uniform 307.15;
        value           uniform 307.15;
    }
    
    FrontNBack
    {
        type empty;
    }   

}


// ************************************************************************* //
