TestCases/TaylorBubbleBoiling/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0.02 0);

boundaryField
{
    "(Walls|Heater)"
    {
        type        noSlip;
    }
    

    Inlet
    {
        type        fixedValue;   
        value       uniform (0 0.02 0); 
    }

    Outlet
    {
        type            fluxCorrectedVelocity;
        phi             phi;
        rho             rho;
    }
    
    FrontNBack
    {
        type empty;
    }  

}


// ************************************************************************* //
