TestCases/TaylorBubbleBoiling/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0      0       -0.001)
    (0.01   0       -0.001)
    (0.01   0.3     -0.001)
    (0      0.3     -0.001)
    
    
    (0      0        0.001)
    (0.01   0        0.001)
    (0.01   0.3      0.001)
    (0      0.3      0.001)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 300 1) simpleGrading (1 1 1)       
);


edges
(
);

boundary
(
    Inlet 
    {
        type    patch;
        faces
        (
            (0 1 5 4)  
        );
    }
    
    
    Outlet 
    {
        type    patch;
        faces
        (
            (2 3 7 6)  
        );
    }


    Walls
    {
        type    wall;
        faces
        (
            (0 4 7 3)
            (1 2 6 5)  
        );
    }


   
    FrontNBack
    {
        type    empty;
        faces
        (
            (0 3 2 1)  
            (4 5 6 7)
        );
    
    }
    

);

mergePatchPairs
(
);


// ************************************************************************* //
